docs/papers/20250226-riemstega.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-10-23 Thu 13:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>RiemStega: Covariance-Based Loss for Print-Proof Transmission of Data in Images</title>
<meta name="author" content="Aniana Cruz, *Guilherme Schardong*, Luiz Schirmer, João Marcos, Farhad Shadmand, Nuno Gonçalves" />
<meta name="generator" content="Org Mode" />
<meta name="referrer" content="origin" />
<link rel="stylesheet" href="../css/tufte.css" type="text/css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">RiemStega: Covariance-Based Loss for Print-Proof Transmission of Data in Images</h1>

<div id="outline-container-orgfce31d3" class="outline-2">
<h2 id="orgfce31d3">Abstract</h2>
<div class="outline-text-2" id="text-orgfce31d3">
<p>
Covariance matrices outperform first-order features in many tasks, attracting considerable attention from the computer vision research community. Covariance matrices encode second-order statistics between features, at the same time it is robust to noise. Based on this, we propose representing images by covariance matrices and defining a loss function that measures the distance between them through the Riemannian distance. Motivated by the robustness and invariance properties of the affine invariant Riemannian metric the proposed method was validated in printer-proof data transmission, which is a challenging task due to the trade-off between image quality and message recovery capabilities after printing and digitization procedures. The effectiveness of this approach was systematically assessed using MS COCO and IMM Face datasets. The results demon-strated that the proposed approach outperforms conventional methods that use Euclidean distance, generating encoded images with better quality and achieving higher recovery accuracy in printed images. Additionally, a broader application of the proposed loss was successfully tested in image generation tasks, using generative adversarial networks (GANs).
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Aniana Cruz, <b>Guilherme Schardong</b>, Luiz Schirmer, João Marcos, Farhad Shadmand, Nuno Gonçalves</p>
<p class="date">Created: 2025-10-23 Thu 13:47</p>
</div>
</body>
</html>
